// src/components/charts/mockData.js

export const weeklyData = [
  { day: "2024-01-01", سكر: 100, نبض: 75, ضغط_الدم: 120 },
  { day: "2024-01-02", سكر: 95, نبض: 72, ضغط_الدم: 118 },
  { day: "2024-01-03", سكر: 98, نبض: 70, ضغط_الدم: 122 },
  { day: "2024-01-04", سكر: 102, نبض: 73, ضغط_الدم: 125 },
  { day: "2024-01-05", سكر: 90, نبض: 71, ضغط_الدم: 119 },
  { day: "2024-01-06", سكر: 96, نبض: 74, ضغط_الدم: 121 },
  { day: "2024-01-07", سكر: 97, نبض: 73, ضغط_الدم: 123 },
];

export const monthlyData = [
  { month: "يناير", سكر: 95, نبض: 72, ضغط_الدم: 118 },
  { month: "فبراير", سكر: 92, نبض: 73, ضغط_الدم: 115 },
  { month: "مارس", سكر: 97, نبض: 71, ضغط_الدم: 120 },
  { month: "أبريل", سكر: 91, نبض: 74, ضغط_الدم: 117 },
  { month: "مايو", سكر: 94, نبض: 73, ضغط_الدم: 119 },
  { month: "يونيو", سكر: 93, نبض: 72, ضغط_الدم: 118 },
];
